prod-deploy/results/prod-01-5-rados-ec-vs-rep-mechanism-20260718-233945/cephfs-rep-baseline/layout/fio.txt
storage_test: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
[...]

storage_test: (groupid=0, jobs=128): err= 0: pid=3856673: Sun Jul 19 20:20:08 2026
  write: IOPS=1259, BW=5039MiB/s (5284MB/s)(128GiB/26011msec); 0 zone resets
    slat (usec): min=157, max=852272, avg=4821.82, stdev=35907.47
    clat (msec): min=5, max=25539, avg=12221.16, stdev=8337.40
     lat (msec): min=6, max=25636, avg=12225.99, stdev=8336.96
    clat percentiles (msec):
     |  1.00th=[   95],  5.00th=[  969], 10.00th=[ 1670], 20.00th=[ 3507],
     | 30.00th=[ 5000], 40.00th=[ 6946], 50.00th=[11879], 60.00th=[16845],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min= 2674, max=12074, per=100.00%, avg=6815.13, stdev=22.58, samples=1282
   iops        : min=  427, max= 4551, avg=1806.98, stdev= 8.35, samples=2424
  lat (msec)   : 10=0.13%, 20=0.16%, 50=0.29%, 100=0.47%, 250=0.44%
  lat (msec)   : 500=0.26%, 750=0.73%, 1000=2.68%, 2000=6.98%, >=2000=87.87%
  cpu          : usr=0.41%, sys=1.13%, ctx=32805, majf=2, minf=592890
  IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=6.2%, 32=12.5%, >=64=75.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.8%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=5039MiB/s (5284MB/s), 5039MiB/s-5039MiB/s (5284MB/s-5284MB/s), io=128GiB (137GB), run=26011-26011msec